config/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СтартНаСервере()
	
	Для каждого СтрокаТЧ из Объект.ТЧ Цикл
		Сообщить(
		"Номенклатура: " + СтрокаТЧ.Номенклатура + ", "
		+ "Количество: " + СтрокаТЧ.Количество	
		);
	КонецЦикла; 
	Сообщить("Общее количество строк ТЧ: " + Объект.ТЧ.Количество());  
	
	//Для счетчик = 0 по 10 Цикл
	//	Сообщить(счетчик * 2);
	//КонецЦикла;  
	
	//счетчикПример = 0;
	//Пока счетчикПример < 10 Цикл    
	//	счетчикПример = счетчикПример + 1;
	//	Сообщить(счетчикПример)
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
	СтартНаСервере();
КонецПроцедуры
